{
  "About me": "Über mich",
  "Skills": "Fähigkeiten",
  "Projects": "Projekte",
  "Contact": "Kontakt",
  "I’m a Junior Frontend Developer specializing in building modern, responsive web applications with React. I have hands-on experience developing real-world projects, including AI-powered tools and video streaming platforms, and have worked in both local and international team environments. I’m familiar with using AI tools in the development process and focus on building secure, performant, and user-friendly interfaces. I enjoy collaborating with teams and solving challenging problems.": "Ich bin ein Junior Frontend Developer, der sich auf die Entwicklung moderner und responsiver Webanwendungen mit React spezialisiert hat. Ich habe praktische Erfahrung in der Umsetzung realer Projekte, darunter KI-gestützte Tools und Video-Streaming-Plattformen, und habe sowohl in lokalen als auch in internationalen Teams gearbeitet. Ich bin mit dem Einsatz von KI-Tools im Entwicklungsprozess vertraut und lege großen Wert auf sichere, performante und benutzerfreundliche Oberflächen. Ich arbeite gerne im Team und löse mit Begeisterung anspruchsvolle Aufgaben.",
  "Education": "Ausbildung",
  "Experience": "Erfahrung",
  "Intern Developer — Owj Company (Iran)": "Praktikant Entwickler — Owj Unternehmen (Iran)",
  "Junior Developer — Iranian Software Company (Iran)": "Junior Entwickler — Iranische Softwarefirma (Iran)",
  "Software Development Internship — Duration: 6 months": "Praktikum in der Softwareentwicklung — Dauer: 6 Monate",
  "Technical": "Technische",
  "Interpersonal": "Zwischenmenschliche",
  "Soft Skills": "Soziale Kompetenzen",
  "Team Collaboration": "Teamarbeit",
  "Communication": "Kommunikation",
  "Attention to Detail": "Detailgenauigkeit",
  "Birth Date": "Geburtsdatum",
  "Location": "Ort",
  "Marital Status": "Familienstand",
  "Single": "Ledig",
  "Tools": "Werkzeuge",
  "Your message": "Ihre Nachricht",
  "Your email": "Ihre E-Mail",
  "Your name": "Ihr Name",
  "Send message" : "Nachricht senden",
  "Gained a strong foundation in programming logic and problem solving concepts": "Erwarb eine solide Grundlage in Programmierlogik und Problemlösungskonzepten",
  "Worked with C# to implement basic algorithms and application logic": "Arbeitete mit C#, um grundlegende Algorithmen und Anwendungslogik zu implementieren",
  "Learned how to break down problems and design structured solutions": "Lernte, Probleme zu zerlegen und strukturierte Lösungen zu entwerfen",
  "Improved understanding of clean code principles and code readability": "Verbesserte das Verständnis für Clean-Code-Prinzipien und Code-Lesbarkeit",
  "Experienced working in a real team environment and following development workflows": "Sammelte Erfahrung in der Arbeit in einem echten Teamumfeld und der Einhaltung von Entwicklungsabläufen",
  "Worked on a real-world railway monitoring platform used for managing and visualizing train-related data": "Arbeitete an einer realen Bahnüberwachungsplattform zur Verwaltung und Visualisierung von zugbezogenen Daten",
  "Refactored complex React components to improve readability and maintainability": "Refaktorierte komplexe React-Komponenten zur Verbesserung der Lesbarkeit und Wartbarkeit",
  "Improved notification and state handling using better component structure and state management patterns": "Verbesserte die Benachrichtigungs- und Zustandsverwaltung durch bessere Komponentenstruktur und State-Management-Muster",
  "Collaborated with the team to enhance UI consistency and user experience": "Arbeitete mit dem Team zusammen, um die UI-Konsistenz und Benutzererfahrung zu verbessern",
  "Focused on performance, security considerations, and backward compatibility": "Konzentrierte sich auf Leistung, Sicherheitsaspekte und Abwärtskompatibilität",
  "Helped improve UI scalability for future features": "Half, die Skalierbarkeit der Benutzeroberfläche für zukünftige Funktionen zu verbessern"
}
